import React, { FunctionComponent } from 'react';
import './TermsTw.scss';
const TermsTw: FunctionComponent = () => {
  return (
    <React.Fragment>
      <div>
        <h4 className="text-center">條款和條件</h4>
        <h5 className="text-center">生效日期：2020年7月25日</h5>
        <h5 className="text-center">涵蓋的網站：https://github.com/marshal604/debt-assistant </h5>
        <p>
          協議：Hubert Yang（以下簡稱“公司”）提供的對本網站和本網站服務的使用
          遵守以下條款和條件（以下簡稱“協議”），其中所有部分和子部分均專門 通過引用併入本文。本協議管轄本網站上所有頁面的使用（以下統稱
          稱為“網站”）以及由本網站提供或在本網站上提供的任何服務（“服務”）。
        </p>
        <p> 1）定義本協議中提及的各方應定義如下：</p>
        <p>
          a）公司，我們：公司作為網站的創建者，運營者和發布者，製作網站和某些服務 可供用戶使用。 Hubert
          Yang，Company，Us，We，Our，Ours和其他第一人稱代詞將本公司稱為 以及公司的所有員工和分支機構。
        </p>
        <p>b）您（用戶，客戶）：在本協議中，您作為網站的用戶將與第二人稱 代詞，例如“您”，“您的”，“您的”或“用戶”或“客戶”。</p>
        <p> c）各方：本協議的各方（本公司和您）統稱為各方。 </p>
        <p>
          2）同意並接受通過使用本網站，您保證您已經閱讀並閱讀了本協議，並且您同意
          受其約束。如果您不同意受本協議的約束，請立即離開網站。本公司僅同意 如果您同意本協議，則向您提供對本網站和服務的使用。
        </p>
        <p>
          3）使用本網站的許可由於您使用本網站或服務，公司可能會向您提供某些信息。
          此類信息可能包括但不限於公司開發的文檔，數據或信息，以及其他
          可能有助於您使用網站或服務的材料（“公司材料”）。在遵守本協議的前提下，公司
          授予您非專有，有限，不可轉讓和可撤銷的許可，以僅將本公司材料用於與
          您對網站和服務的使用。公司資料不得用於任何其他目的，並且本許可終止 在您停止使用網站或服務時或在本協議終止時。
        </p>
        <p>
          4）知識產權您同意本網站和本公司提供的所有服務均為本公司的財產，
          包括所有版權，商標，商業秘密，專利和其他知識產權（“公司IP”）。您同意
          公司對公司IP擁有所有權利，所有權和利益，並且您不會將公司IP用於任何非法或非法行為。
          侵權目的。您同意不以任何方式（包括電子方式或通過 未經書面許可，註冊任何新商標，商號，服務商標或統一資源定位符（URL） 公司的許可。
        </p>
        <p>
          5）用戶義務作為網站或服務的用戶，可能會要求您向我們註冊。當您這樣做時，您將選擇一個
          用戶標識符（可能是您的電子郵件地址或其他術語）以及密碼。您也可以提供個人
          信息，包括但不限於您的姓名。您有責任確保此信息的準確性。這個 識別信息將使您能夠使用網站和服務。您不得與任何人共享此類識別信息
          第三方，並且如果您發現自己的識別信息遭到洩露，則表示您同意立即通過以下方式通知我們
          寫作。電子郵件通知就足夠了。您有責任維護您的身份證明的安全性 信息，並讓我們知道您的識別信息的任何變化。提供虛假或不正確的信息
          信息，或使用網站或服務進行進一步的欺詐或非法活動是立即終止此行為的理由 協議。
        </p>
        <p>
          6）可接受的使用您同意不將網站或服務用於任何非法目的或本條款禁止的任何目的
          條款。您同意不以任何可能損害網站，服務或一般業務的方式使用網站或服務 公司。
        </p>
        <p> a）您進一步同意不使用網站或服務：</p>
        <p> I）騷擾，虐待或威脅他人或以其他方式侵犯任何人的合法權利； </p>
        <p> II）侵犯公司或任何第三方的任何知識產權； </p>
        <p> III）上傳或以其他方式傳播可能損害他人財產的計算機病毒或其他軟件； </p>
        <p> IV）進行任何欺詐； </p>
        <p> V）從事或建立任何非法賭博，抽獎或金字塔計劃； </p>
        <p> VI）發布或分發任何淫穢或誹謗性材料； </p>
        <p>VII）發布或散佈任何煽動暴力，仇恨或歧視任何團體的內容； VIII）非法 收集有關他人的信息。</p>
        <p>
          7）隱私信息通過使用網站和服務，您可以向我們提供某些信息。通過使用
          網站或服務，即表示您授權公司在美國和我們可能會在其他國家/地區使用的信息 操作。
        </p>
        <p>
          a）我們可能收集或接收的信息：註冊帳戶時，您向我們提供了有效的電子郵件地址，並且可能
          向我們提供其他信息，例如您的姓名或帳單信息。根據您使用我們網站的方式或
          服務，我們可能還會收到您用來訪問我們網站的外部應用程序中的信息，或者我們可能會收到
          通過各種Web技術（例如Cookie，日誌文件，透明gif，Web信標或其他）獲取信息。
        </p>
        <p>
          b）我們如何使用信息：我們使用從您那裡收集的信息來確保您在我們網站上的持續良好體驗，
          包括通過電子郵件通訊。我們還可能跟踪收到的被動信息的某些方面，以改善我們的 營銷和分析，為此，我們可能與第三方提供商合作。
        </p>
        <p>
          c）您如何保護您的信息：如果您想禁止我們訪問從我們收到的任何被動信息
          使用各種技術，您可以選擇在Web瀏覽器中禁用cookie。請注意，公司仍將 接收您提供的有關您的信息，例如您的電子郵件地址。
        </p>
        <p>8）逆向工程與安全您同意不採取以下任何行動：a）逆向工程或試圖 從網站或服務上進行反向工程或反彙編任何代碼或軟件；</p>
        <p>b）通過任何未經授權的訪問，規避加密或其他安全性侵犯網站或服務的安全性 工具，數據挖掘或對任何主機，用戶或網絡的干擾。</p>
        <p>9）數據丟失公司對您的帳戶或內容的安全性不承擔任何責任。您同意您的使用 網站或服務由您自擔風險。</p>
        <p>
          10）賠償您同意捍衛和賠償公司及其任何關聯公司（如適用），並使我們免受傷害
          反對可能由於您的使用或與之相關的任何法律要求和要求，包括合理的律師費 濫用網站或服務，您違反本協議或您的行為或行為。您同意公司應
          如果公司願意，可以選擇自己的法律顧問，並可以參加自己的辯護。
        </p>
        <p>
          11）垃圾郵件政策嚴禁您將網站或公司的任何服務用於非法垃圾郵件活動，
          包括從他人那裡收集電子郵件地址和個人信息，或發送任何大規模的商業電子郵件。
        </p>
        <p>
          12）第三方鏈接和內容公司有時可能會發布指向第三方網站或其他服務的鏈接。您同意
          對於因您使用鏈接的任何第三方服務而造成的任何損失或損害，公司概不負責 從我們的網站。
        </p>
        <p>
          13）修改和變更公司可以不時通知您，隨時不時修改本協議。您 同意公司有權修改本協議或修改本協議中包含的任何內容。您進一步同意所有
          對本協議的修改在網站上發布後立即具有全部效力，並且修改或 變體將取代本協議的任何先前版本，除非特別提及或合併了先前版本
          對本協議的最新修改或變更。
        </p>
        <p>a）在任何法院裁定本協議的任何部分或子部分無效或無效的情況下，您同意 之前，本協議的有效版本應被視為可執行且在最大程度上有效。</p>
        <p>
          b）您同意例行監視本協議，並參考本協議頂部的生效日期進行說明 修改或變化。您還同意在這樣做時清除緩存，以避免訪問此緩存的早期版本。
          協議。您同意對本協議進行任何修改後繼續使用本網站即表示您 繼續同意本協議。
        </p>
        <p>c）如果您未能監視對本協議的任何修改或變更，則您同意此類失敗應 被視為您對修改後的協議的審查權利的肯定放棄。</p>
        <p>
          14）完整協議本協議構成了當事方之間對任何或所有使用方式的全部理解。 本網站。本協議取代並取代之前或同期的所有書面或口頭協議或諒解，
          關於本網站的使用。
        </p>
        <p>
          15）服務中斷公司可能需要中斷您對網站的訪問以進行維護或緊急情況 有計劃或無計劃的服務。您同意，您對網站的訪問可能會受到意外或
          因任何原因導致計劃外停機，但對於因以下原因造成的任何損害或損失，公司概不負責 這樣的停機時間。
        </p>
        <p>
          16）期限，終止和中止公司可以隨時出於任何原因與您終止本協議，無論有無
          原因。如果您違反此處概述的任何條款，公司明確保留終止本協議的權利， 包括但不限於違反公司或第三方的知識產權，不遵守
          適用法律或其他法律義務，和/或發布或分發非法材料。如果您已經註冊了 您也可以隨時通過與我們聯繫並要求終止來終止本協議。在終止處
          在本協議中，任何預期會因其性質而終止的條款應繼續有效， 影響。
        </p>
        <p>
          17）不作任何保證您同意您對網站和服務的使用承擔唯一和唯一的風險，並且任何服務
          我們提供的內容均基於“原樣”。本公司特此明確拒絕任何形式的任何明示或暗示保證 種類，包括但不限於對特定用途適用性的隱含保證和
          適銷性。本公司不保證本網站或服務將滿足您的需求或本網站或服務
          不會中斷，沒有錯誤或安全。本公司也不對任何產品的可靠性或準確性做任何保證。
          網站上的信息或通過服務獲得的信息。您同意，通過您的服務可能對您造成的任何損害
          計算機系統，或由於使用網站或服務而導致數據丟失的後果由您獨自承擔，並且 本公司對任何此類損壞或損失不承擔任何責任。
        </p>
        <p>
          18）責任範圍對於您因使用本網站而給您造成的任何損害，公司概不負責 或法律允許的最大範圍內的服務。公司由此引起的或與此有關的最大責任
          協議僅限於一百（$ 100）美元或您在最近六（6）個月內向公司支付的金額中較大者
          個月。本部分適用於您的所有索賠，包括但不限於利潤或收入損失，因此 懲罰性賠償，疏忽，嚴格責任，欺詐或任何形式的侵權。
        </p>
        <p> 19）一般規定：</p>
        <p> a）語言：根據本協議進行的所有通信或發出的通知均應使用英語。</p>
        <p>
          b）管轄權，地點和法律選擇：您通過使用網站或服務，即表示您同意台灣法律
          與本協議有關或由本協議引起的任何事項或爭議，以及可能引起的任何形式的爭議 您與公司之間的法律衝突條款除外。如果明確允許任何訴訟
          根據本協議啟動之時，雙方同意服從州政府和聯邦法院的個人管轄權
          以下縣：台灣的台北市。雙方同意，這種法律選擇，地點和管轄權條款是不允許的，
          但本質上是強制性的。您特此放棄對任何場所提出異議的權利，包括主張使用論壇學說 不便或類似的學說。
        </p>
        <p>
          c）仲裁：如果雙方之間因本協議引起爭議，則雙方應首先 嘗試以真誠的態度親自解決爭端。如果這些個人解決方案嘗試失敗，則各當事方應
          將爭議提交具有約束力的仲裁。仲裁應在以下縣進行：台北。仲裁 應由單個仲裁員進行，並且該仲裁員無權增加任何當事方，可以改變本條的規定
          達成協議，判處懲罰性賠償或證明課程。仲裁員應受適用的適用聯邦法律約束
          以及以下州的法律：台灣。每一當事方應支付自己的費用。要求仲裁的索賠
          本節中的內容包括但不限於：合同索賠，侵權索賠，基於聯邦和州法律的索賠，以及
          根據當地法律，法規，法規或規章提出的索賠。公司的知識產權主張將不予受理 仲裁，除本分節外，均可提起訴訟。雙方同意本部分
          協議，放棄了他們對陪審團進行陪審團審判的任何權利。
        </p>
        <p>
          d）轉讓：不得在本協議中轉讓，出售，租賃或以其他方式轉讓本協議或本協議項下授予的權利。
          全部或部分由您。本協議或根據本協議授予的權利是否應通過轉讓，出售，租賃或以其他方式轉移
          公司的權利和義務將受任何受讓人，管理人員，繼任人和 執行者。
        </p>
        <p>
          e）可擴展性：如果法院或主管部門認為本協議的任何部分或子部分無效或無法執行，
          仲裁員，其餘部分和子部分將得到最大程度的執行。在這種情況下，其餘 本協議應繼續有效。
        </p>
        <p>
          f）不放棄：如果我們未能執行本協議的任何規定，則不構成對任何放棄的放棄
          該規定或任何其他規定的未來執行。放棄本協議的任何部分或子部分將不會 構成對任何其他部分或子部分的放棄。
        </p>
        <p>g）僅為了方便而使用的標題：本協議中各部分和子部分的標題僅是為了方便和組織。 標題不得影響本協議任何條款的含義。</p>
        <p>h）沒有代理，合夥或合資企業：雙方之間未建立任何代理，合夥或合資企業 本協議的結果。任何一方均無權約束另一方與第三方。</p>
        <p>
          i）不可抗力：對於因超出其合理控制範圍的原因而導致的任何失職，公司概不負責，包括但不限於：
          不限於上帝的行為，民事當局的行為，軍事當局的行為，暴動，禁運，自然和自然行為 災難以及可能由於不可預見的情況而導致的其他行為。
        </p>
        <p>
          j）允許的電子通訊：根據本協議，允許雙方進行電子通訊，包括
          電子郵件或傳真。如有任何疑問或疑慮，請通過以下地址給我們發送電子郵件：marshal604@gmail.com。
        </p>
      </div>
    </React.Fragment>
  );
};

export default TermsTw;
